In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import warnings
from Utils import helper as hp
warnings.filterwarnings('ignore')
import pyarrow.json as pj
import json

In [7]:
df = pd.DataFrame()

In [3]:
lines_json = []
with open('../TestData/Yelp/review.json', 'r', encoding='utf-8') as f:
    # Iterate over each line in the JSON file
    for line in f:
        # Parse the JSON string into a dictionary
        data = json.loads(line)
        lines_json.append(data)

reviews_df = pd.DataFrame(lines_json)

In [5]:
# Vista Preliminar de Datos

print(reviews_df.info())
reviews_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6990280 entries, 0 to 6990279
Data columns (total 9 columns):
 #   Column       Dtype
---  ------       -----
 0   review_id    object
 1   user_id      object
 2   business_id  object
 3   stars        float64
 4   useful       int64
 5   funny        int64
 6   cool         int64
 7   text         object
 8   date         object
dtypes: float64(1), int64(3), object(5)
memory usage: 480.0+ MB
None

,review_id,user_id,business_id,stars,useful,funny,cool,text,date
0,KU_O5udG6zpxOg-VcAEodg,mh_-eMZ6K5RLWhZyISBhwA,XQfwVwDr-v0ZS3_CbbE5Xw,3.0,0,0,0,"If you decide to eat here, just be aware it is...",2018-07-07 22:09:11
1,BiTunyQ73aT9WBnpR9DZGw,OyoGAe7OKpv6SyGZT5g77Q,7ATYjTIgM3jUlt4UM3IypQ,5.0,1,0,1,I've taken a lot of spin classes over the year...,2012-01-03 15:28:18
2,saUsX_uimxRlCVr67Z4Jig,8g_iMtfSiwikVnbP2etR0A,YjUWPpI6HXG530lwP-fb2A,3.0,0,0,0,Family diner. Had the buffet. Eclectic assortm...,2014-02-05 20:30:30
3,AqPFMleE6RsU23_auESxiA,_7bHUi9Uuf5__HHc_Q8guQ,kxX2SOes4o-D3ZQBkiMRfA,5.0,1,0,1,"Wow! Yummy, different, delicious. Our favo...",2015-01-04 00:01:03
4,Sx8TMOWLNuJBWer-0pcmoA,bcjbaE6dDog4jkNY91ncLQ,e4Vwtrqf-wpJfwesgvdgxQ,4.0,1,0,1,Cute interior and owner (?) gave us tour of up...,2017-01-14 20:54:15

In [7]:
# Reivsión de Nulos

reviews_overview = hp.data_overview(reviews_df)
reviews_overview

  nombre_campo         tipo_datos  NO_nulos_%  nulos_%  nulos_cantidad
0    review_id    [<class 'str'>]       100.0      0.0               0
1      user_id    [<class 'str'>]       100.0      0.0               0
2  business_id    [<class 'str'>]       100.0      0.0               0
3        stars  [<class 'float'>]       100.0      0.0               0
4       useful    [<class 'int'>]       100.0      0.0               0
5        funny    [<class 'int'>]       100.0      0.0               0
6         cool    [<class 'int'>]       100.0      0.0               0
7         text    [<class 'str'>]       100.0      0.0               0
8         date    [<class 'str'>]       100.0      0.0               0

In [8]:
# Revisión de duplicados

reviews_df[reviews_df.duplicated()]

Empty DataFrame
Columns: [review_id, user_id, business_id, stars, useful, funny, cool, text, date]
Index: []

In [9]:
# Revisión de Outliers
outliers_columns = ['stars','useful','funny','cool']

for column in outliers_columns:
    hp.outliers_percentage(reviews_df, column)
    print("-"*66)

Total de outliers en stars: 0 de 6990280 registros -- 0.0 %
------------------------------------------------------------------
Total de outliers en useful: 83325 de 6990280 registros -- 1.19 %
------------------------------------------------------------------
Total de outliers en funny: 59789 de 6990280 registros -- 0.86 %
------------------------------------------------------------------
Total de outliers en cool: 58316 de 6990280 registros -- 0.83 %
------------------------------------------------------------------